Обработки/Reports/_ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОстаткиДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНепройденныеСверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСДвижениями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОстатка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиОстаткиЗаВычетомЗаблокированныхНаМНО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОстаткиДенежныхСредств/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Остатки денежных средств",
		"0.30",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ОстаткиДенежныхСредств_УКПИ_ПИФ",
		"Остатки денежных средств УКПИ (ПИФ)",,  
		Ложь, 
		"ВызовСерверногоМетода");
		
	РегистрационныеДанные.Вставить("Команды", Команды);
		
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//     элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт

	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);

	Если ИдентификаторКоманды = "ОстаткиДенежныхСредств_УКПИ_ПИФ" Тогда
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата())) Тогда
			ЭтотОбъект.Период.ДатаНачала = НачалоДня(Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2));
			ЭтотОбъект.Период.ДатаОкончания = КонецДня(ЭтотОбъект.Период.ДатаНачала);
			ЭтотОбъект.Организация  = ПараметрыКоманды.Организация;
			ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
			ЭтотОбъект.РежимОтбора = 4;
			
			ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
			
#Область СборСтатистики_Начало

			Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
			
			ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
				ЭтотОбъект, 
				"Период,Организация", 
				Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
			
			Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
				Механизм,
				ПараметрыВыполненияДляСбораСтатистики.Хранилище,
				ПараметрыВыполненияДляСбораСтатистики.Описание);

#КонецОбласти
			
			ОтправитьОтчет(ПолучателиОповещения);
			
#Область СборСтатистики_Конец

			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

#КонецОбласти
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);	
	
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("Организация",				ЭтотОбъект.Организация);
	Параметры.УстановитьЗначениеПараметра("НачалоПериода",				ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("КонецПериода",				ЭтотОбъект.Период.ДатаОкончания);
	Параметры.УстановитьЗначениеПараметра("КодыИсключаемыхПортфелей",	РаботаСКоллекциями.ЗначениеВМассив("О")); // НЕОПРЕДЕЛЁН
	Параметры.УстановитьЗначениеПараметра("ВариантОтчета",				ВариантОтчета);
	
	Параметры.Элементы.Найти("СчетДоверительногоУправления").Использование			= Ложь;
	Параметры.Элементы.Найти("ВидДеятельности").Использование						= Ложь;
	Параметры.Элементы.Найти("БанковскийСчет").Использование						= Ложь;
	Параметры.Элементы.Найти("ВидДоговораДоверительногоУправления").Использование	= Ложь;
	Параметры.Элементы.Найти("ТипОстатка").Использование							= Ложь;	
	Параметры.Элементы.Найти("ТолькоСДвижениями").Использование						= Ложь;
	Параметры.Элементы.Найти("ТолькоНепройденныеСверки").Использование				= Ложь;
	Параметры.Элементы.Найти("ПредставлениеОтбора").Использование					= Ложь;	
	
	Если ЭтотОбъект.РежимОтбора = 1 Тогда
		Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ИначеЕсли ЭтотОбъект.РежимОтбора = 2 Тогда 
		Параметры.УстановитьЗначениеПараметра("ВидДеятельности", ЭтотОбъект.ВидДеятельности);
	ИначеЕсли ЭтотОбъект.РежимОтбора = 3 Тогда 
		Параметры.УстановитьЗначениеПараметра("БанковскийСчет", ЭтотОбъект.БанковскийСчет);	
	ИначеЕсли ЭтотОбъект.РежимОтбора = 4 Тогда 
		Параметры.УстановитьЗначениеПараметра("ВидДоговораДоверительногоУправления", ЭтотОбъект.ВидДоговораДоверительногоУправления);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ТипОстатка) Тогда
		Параметры.УстановитьЗначениеПараметра("ТипОстатка", ЭтотОбъект.ТипОстатка);
	КонецЕсли;
	
	// Представление отбора
	
	ОтборКлиентов = Новый Массив;
	
	Если ЭтотОбъект.ТолькоСДвижениями Тогда
		Параметры.УстановитьЗначениеПараметра("ТолькоСДвижениями", ЭтотОбъект.ТолькоСДвижениями);
		ОтборКлиентов.Добавить("только с движениями д/с");	
	КонецЕсли;
	Если ЭтотОбъект.ТолькоНепройденныеСверки Тогда
		Параметры.УстановитьЗначениеПараметра("ТолькоНепройденныеСверки", ЭтотОбъект.ТолькоНепройденныеСверки);
		ОтборКлиентов.Добавить("только непройденные сверки");	
	КонецЕсли;
	
	Если ОтборКлиентов.Количество() > 0 Тогда
		Параметры.УстановитьЗначениеПараметра("ПредставлениеОтбора", СтрСоединить(ОтборКлиентов, "; "));
	КонецЕсли;
	
	// Получим таблицу клиентов
	
	ТаблицаЗначенийРезультат = Новый ТаблицаЗначений;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,  ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначенийРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ТаблицаЗначенийРезультат.Свернуть("СчетДоверительногоУправления");
	
	ЭтотОбъект.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыведенныеСчетаДоверительногоУправления", ТаблицаЗначенийРезультат.ВыгрузитьКолонку("СчетДоверительногоУправления"));
	
	// Компоновка
	Если ВариантОтчета = "ОстаткиСМНО" Тогда		
		ЭтотОбъект.КомпоновщикНастроек.Настройки.Выбор.Элементы.Получить(ЭтотОбъект.КомпоновщикНастроек.Настройки.Выбор.Элементы.Количество() - 1).Использование = ЭтотОбъект.ВывестиОстаткиЗаВычетомЗаблокированныхНаМНО;
	КонецЕсли;
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОтправитьОтчет(ПолучателиОповещения) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЭтотОбъект.СкомпоноватьРезультат(ДокументРезультат); 
	                                       
	Если ДокументРезультат.ВысотаТаблицы > 2 Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		
		ТемаПисьма = "Остатки денежных средств ПИФ УКПИ за " + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yy");
		
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЭтотОбъект.РежимОтбора = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
	ИначеЕсли ЭтотОбъект.РежимОтбора = 2 Тогда 
		ПроверяемыеРеквизиты.Добавить("ВидДеятельности");
	ИначеЕсли ЭтотОбъект.РежимОтбора = 4 Тогда 
		ПроверяемыеРеквизиты.Добавить("ВидДоговораДоверительногоУправления");
	КонецЕсли;	
	
КонецПроцедуры
